In [1]:
import pandas as pd

In [2]:
dicionario1 = {
    "ID": [1,2,3,4],
    "Nome": ["Ana", "Pedro", "Maria", "João"],
    "Setores": ["RH", "Vendas", "Administrativo", "Produção"]
}

dicionario2 = {
    "ID": [1,2,3,4],
    "Salários": [3000,2800,3200,2500]
}

In [3]:
# Criando o dataframe de cada dicionario acima

dados1 = pd.DataFrame(dicionario1)
dados2 = pd.DataFrame(dicionario2)

In [5]:
dados1.head() # Exibe o primeiro conjunto de informações dos funcionários

   ID   Nome         Setores
0   1    Ana              RH
1   2  Pedro          Vendas
2   3  Maria  Administrativo
3   4   João        Produção

In [6]:
dados2.head() # Exibe o segundo conjunto de informações dos funcionários

   ID  Salários
0   1      3000
1   2      2800
2   3      3200
3   4      2500

In [7]:
dataframe_n = pd.merge(dados1, dados2, how='inner', on='ID') # une o dataframe a partir das semelhanças dos ids nas colunas

In [8]:
dataframe_n.head() # exibe o dataframe unificado que foi criado juntando as informações dos dois dataframes

   ID   Nome         Setores  Salários
0   1    Ana              RH      3000
1   2  Pedro          Vendas      2800
2   3  Maria  Administrativo      3200
3   4   João        Produção      2500